#pragma once
#include "dex.h"

static const char *const KO_SPECIES_NAMES[DEX_COUNT + 1] = {
  "?",  // 0
  "이상해씨",  // 1
  "이상해풀",  // 2
  "이상해꽃",  // 3
  "파이리",  // 4
  "리자드",  // 5
  "리자몽",  // 6
  "꼬부기",  // 7
  "어니부기",  // 8
  "거북왕",  // 9
  "캐터피",  // 10
  "단데기",  // 11
  "버터플",  // 12
  "뿔충이",  // 13
  "딱충이",  // 14
  "독침붕",  // 15
  "구구",  // 16
  "피죤",  // 17
  "피죤투",  // 18
  "꼬렛",  // 19
  "레트라",  // 20
  "깨비참",  // 21
  "깨비드릴조",  // 22
  "아보",  // 23
  "아보크",  // 24
  "피카츄",  // 25
  "라이츄",  // 26
  "모래두지",  // 27
  "고지",  // 28
  "니드런♀",  // 29
  "니드리나",  // 30
  "니드퀸",  // 31
  "니드런♂",  // 32
  "니드리노",  // 33
  "니드킹",  // 34
  "삐삐",  // 35
  "픽시",  // 36
  "식스테일",  // 37
  "나인테일",  // 38
  "푸린",  // 39
  "푸크린",  // 40
  "주뱃",  // 41
  "골뱃",  // 42
  "뚜벅쵸",  // 43
  "냄새꼬",  // 44
  "라플레시아",  // 45
  "파라스",  // 46
  "파라섹트",  // 47
  "콘팡",  // 48
  "도나리",  // 49
  "디그다",  // 50
  "닥트리오",  // 51
  "나옹",  // 52
  "페르시온",  // 53
  "고라파덕",  // 54
  "골덕",  // 55
  "망키",  // 56
  "성원숭",  // 57
  "가디",  // 58
  "윈디",  // 59
  "발챙이",  // 60
  "슈륙챙이",  // 61
  "강챙이",  // 62
  "캐이시",  // 63
  "윤겔라",  // 64
  "후딘",  // 65
  "알통몬",  // 66
  "근육몬",  // 67
  "괴력몬",  // 68
  "모다피",  // 69
  "우츠동",  // 70
  "우츠보트",  // 71
  "왕눈해",  // 72
  "독파리",  // 73
  "꼬마돌",  // 74
  "데구리",  // 75
  "딱구리",  // 76
  "포니타",  // 77
  "날쌩마",  // 78
  "야돈",  // 79
  "야도란",  // 80
  "코일",  // 81
  "레어코일",  // 82
  "파오리",  // 83
  "두두",  // 84
  "두트리오",  // 85
  "쥬쥬",  // 86
  "쥬레곤",  // 87
  "질퍽이",  // 88
  "질뻐기",  // 89
  "셀러",  // 90
  "파르셀",  // 91
  "고오스",  // 92
  "고우스트",  // 93
  "팬텀",  // 94
  "롱스톤",  // 95
  "슬리프",  // 96
  "슬리퍼",  // 97
  "크랩",  // 98
  "킹크랩",  // 99
  "찌리리공",  // 100
  "붐볼",  // 101
  "아라리",  // 102
  "나시",  // 103
  "탕구리",  // 104
  "텅구리",  // 105
  "시라소몬",  // 106
  "홍수몬",  // 107
  "내루미",  // 108
  "또가스",  // 109
  "또도가스",  // 110
  "뿔카노",  // 111
  "코뿌리",  // 112
  "럭키",  // 113
  "덩쿠리",  // 114
  "캥카",  // 115
  "쏘드라",  // 116
  "시드라",  // 117
  "콘치",  // 118
  "왕콘치",  // 119
  "별가사리",  // 120
  "아쿠스타",  // 121
  "마임맨",  // 122
  "스라크",  // 123
  "루주라",  // 124
  "에레브",  // 125
  "마그마",  // 126
  "쁘사이저",  // 127
  "켄타로스",  // 128
  "잉어킹",  // 129
  "갸라도스",  // 130
  "라프라스",  // 131
  "메타몽",  // 132
  "이브이",  // 133
  "샤미드",  // 134
  "쥬피썬더",  // 135
  "부스터",  // 136
  "폴리곤",  // 137
  "암나이트",  // 138
  "암스타",  // 139
  "투구",  // 140
  "투구푸스",  // 141
  "프테라",  // 142
  "잠만보",  // 143
  "프리져",  // 144
  "썬더",  // 145
  "파이어",  // 146
  "미뇽",  // 147
  "신뇽",  // 148
  "망나뇽",  // 149
  "뮤츠",  // 150
  "뮤",  // 151
  "치코리타",  // 152
  "베이리프",  // 153
  "메가니움",  // 154
  "브케인",  // 155
  "마그케인",  // 156
  "블레이범",  // 157
  "리아코",  // 158
  "엘리게이",  // 159
  "장크로다일",  // 160
  "꼬리선",  // 161
  "다꼬리",  // 162
  "부우부",  // 163
  "야부엉",  // 164
  "레디바",  // 165
  "레디안",  // 166
  "페이검",  // 167
  "아리아도스",  // 168
  "크로뱃",  // 169
  "초라기",  // 170
  "랜턴",  // 171
  "피츄",  // 172
  "삐",  // 173
  "푸푸린",  // 174
  "토게피",  // 175
  "토게틱",  // 176
  "네이티",  // 177
  "네이티오",  // 178
  "메리프",  // 179
  "보송송",  // 180
  "전룡",  // 181
  "아르코",  // 182
  "마릴",  // 183
  "마릴리",  // 184
  "꼬지모",  // 185
  "왕구리",  // 186
  "통통코",  // 187
  "두코",  // 188
  "솜솜코",  // 189
  "에이팜",  // 190
  "해너츠",  // 191
  "해루미",  // 192
  "왕자리",  // 193
  "우파",  // 194
  "누오",  // 195
  "에브이",  // 196
  "블래키",  // 197
  "니로우",  // 198
  "야도킹",  // 199
  "무우마",  // 200
  "안농",  // 201
  "마자용",  // 202
  "키링키",  // 203
  "피콘",  // 204
  "쏘콘",  // 205
  "노고치",  // 206
  "글라이거",  // 207
  "강철톤",  // 208
  "블루",  // 209
  "그랑블루",  // 210
  "침바루",  // 211
  "핫삼",  // 212
  "단단지",  // 213
  "헤라크로스",  // 214
  "포푸니",  // 215
  "깜지곰",  // 216
  "링곰",  // 217
  "마그마그",  // 218
  "마그카르고",  // 219
  "꾸꾸리",  // 220
  "메꾸리",  // 221
  "코산호",  // 222
  "총어",  // 223
  "대포무노",  // 224
  "딜리버드",  // 225
  "만타인",  // 226
  "무장조",  // 227
  "델빌",  // 228
  "헬가",  // 229
  "킹드라",  // 230
  "코코리",  // 231
  "코리갑",  // 232
  "폴리곤2",  // 233
  "노라키",  // 234
  "루브도",  // 235
  "배루키",  // 236
  "카포에라",  // 237
  "뽀뽀라",  // 238
  "에레키드",  // 239
  "마그비",  // 240
  "밀탱크",  // 241
  "해피너스",  // 242
  "라이코",  // 243
  "앤테이",  // 244
  "스이쿤",  // 245
  "애버라스",  // 246
  "데기라스",  // 247
  "마기라스",  // 248
  "루기아",  // 249
  "칠색조",  // 250
  "세레비",  // 251
  "나무지기",  // 252
  "나무돌이",  // 253
  "나무킹",  // 254
  "아차모",  // 255
  "영치코",  // 256
  "번치코",  // 257
  "물짱이",  // 258
  "늪짱이",  // 259
  "대짱이",  // 260
  "포챠나",  // 261
  "그라에나",  // 262
  "지그제구리",  // 263
  "직구리",  // 264
  "개무소",  // 265
  "실쿤",  // 266
  "뷰티플라이",  // 267
  "카스쿤",  // 268
  "독케일",  // 269
  "연꽃몬",  // 270
  "로토스",  // 271
  "로파파",  // 272
  "도토링",  // 273
  "잎새코",  // 274
  "다탱구",  // 275
  "테일로",  // 276
  "스왈로",  // 277
  "갈모매",  // 278
  "패리퍼",  // 279
  "랄토스",  // 280
  "킬리아",  // 281
  "가디안",  // 282
  "비구술",  // 283
  "비나방",  // 284
  "버섯꼬",  // 285
  "버섯모",  // 286
  "게을로",  // 287
  "발바로",  // 288
  "게을킹",  // 289
  "토중몬",  // 290
  "아이스크",  // 291
  "껍질몬",  // 292
  "소곤룡",  // 293
  "노공룡",  // 294
  "폭음룡",  // 295
  "마크탕",  // 296
  "하리뭉",  // 297
  "루리리",  // 298
  "코코파스",  // 299
  "에나비",  // 300
  "델케티",  // 301
  "깜까미",  // 302
  "입치트",  // 303
  "가보리",  // 304
  "갱도라",  // 305
  "보스로라",  // 306
  "요가랑",  // 307
  "요가램",  // 308
  "썬더라이",  // 309
  "썬더볼트",  // 310
  "플러시",  // 311
  "마이농",  // 312
  "볼비트",  // 313
  "네오비트",  // 314
  "로젤리아",  // 315
  "꼴깍몬",  // 316
  "꿀꺽몬",  // 317
  "샤프니아",  // 318
  "샤크니아",  // 319
  "고래왕자",  // 320
  "고래왕",  // 321
  "둔타",  // 322
  "폭타",  // 323
  "코터스",  // 324
  "피그점프",  // 325
  "피그킹",  // 326
  "얼루기",  // 327
  "톱치",  // 328
  "비브라바",  // 329
  "플라이곤",  // 330
  "선인왕",  // 331
  "밤선인",  // 332
  "파비코",  // 333
  "파비코리",  // 334
  "쟝고",  // 335
  "세비퍼",  // 336
  "루나톤",  // 337
  "솔록",  // 338
  "미꾸리",  // 339
  "메깅",  // 340
  "가재군",  // 341
  "가재장군",  // 342
  "오뚝군",  // 343
  "점토도리",  // 344
  "릴링",  // 345
  "릴리요",  // 346
  "아노딥스",  // 347
  "아말도",  // 348
  "빈티나",  // 349
  "밀로틱",  // 350
  "캐스퐁",  // 351
  "켈리몬",  // 352
  "어둠대신",  // 353
  "다크펫",  // 354
  "해골몽",  // 355
  "미라몽",  // 356
  "트로피우스",  // 357
  "치렁",  // 358
  "앱솔",  // 359
  "마자",  // 360
  "눈꼬마",  // 361
  "얼음귀신",  // 362
  "대굴레오",  // 363
  "씨레오",  // 364
  "씨카이저",  // 365
  "진주몽",  // 366
  "헌테일",  // 367
  "분홍장이",  // 368
  "시라칸",  // 369
  "사랑동이",  // 370
  "아공이",  // 371
  "쉘곤",  // 372
  "보만다",  // 373
  "메탕",  // 374
  "메탕구",  // 375
  "메타그로스",  // 376
  "레지락",  // 377
  "레지아이스",  // 378
  "레지스틸",  // 379
  "라티아스",  // 380
  "라티오스",  // 381
  "가이오가",  // 382
  "그란돈",  // 383
  "레쿠쟈",  // 384
  "지라치",  // 385
  "테오키스",  // 386
  "모부기",  // 387
  "수풀부기",  // 388
  "토대부기",  // 389
  "불꽃숭이",  // 390
  "파이숭이",  // 391
  "초염몽",  // 392
  "팽도리",  // 393
  "팽태자",  // 394
  "엠페르트",  // 395
  "찌르꼬",  // 396
  "찌르버드",  // 397
  "찌르호크",  // 398
  "비버니",  // 399
  "비버통",  // 400
  "귀뚤뚜기",  // 401
  "귀뚤톡크",  // 402
  "꼬링크",  // 403
  "럭시오",  // 404
  "렌트라",  // 405
  "꼬몽울",  // 406
  "로즈레이드",  // 407
  "두개도스",  // 408
  "램펄드",  // 409
  "방패톱스",  // 410
  "바리톱스",  // 411
  "도롱충이",  // 412
  "도롱마담",  // 413
  "나메일",  // 414
  "세꿀버리",  // 415
  "비퀸",  // 416
  "파치리스",  // 417
  "브이젤",  // 418
  "플로젤",  // 419
  "체리버",  // 420
  "체리꼬",  // 421
  "깝질무",  // 422
  "트리토돈",  // 423
  "겟핸보숭",  // 424
  "흔들풍손",  // 425
  "둥실라이드",  // 426
  "이어롤",  // 427
  "이어롭",  // 428
  "무우마직",  // 429
  "돈크로우",  // 430
  "나옹마",  // 431
  "몬냥이",  // 432
  "랑딸랑",  // 433
  "스컹뿡",  // 434
  "스컹탱크",  // 435
  "동미러",  // 436
  "동탁군",  // 437
  "꼬지지",  // 438
  "흉내내",  // 439
  "핑복",  // 440
  "페라페",  // 441
  "화강돌",  // 442
  "딥상어동",  // 443
  "한바이트",  // 444
  "한카리아스",  // 445
  "먹고자",  // 446
  "리오르",  // 447
  "루카리오",  // 448
  "히포포타스",  // 449
  "하마돈",  // 450
  "스콜피",  // 451
  "드래피온",  // 452
  "삐딱구리",  // 453
  "독개굴",  // 454
  "무스틈니",  // 455
  "형광어",  // 456
  "네오라이트",  // 457
  "타만타",  // 458
  "눈쓰개",  // 459
  "눈설왕",  // 460
  "포푸니라",  // 461
  "자포코일",  // 462
  "내룸벨트",  // 463
  "거대코뿌리",  // 464
  "덩쿠림보",  // 465
  "에레키블",  // 466
  "마그마번",  // 467
  "토게키스",  // 468
  "메가자리",  // 469
  "리피아",  // 470
  "글레이시아",  // 471
  "글라이온",  // 472
  "맘모꾸리",  // 473
  "폴리곤Z",  // 474
  "엘레이드",  // 475
  "대코파스",  // 476
  "야느와르몽",  // 477
  "눈여아",  // 478
  "로토무",  // 479
  "유크시",  // 480
  "엠라이트",  // 481
  "아그놈",  // 482
  "디아루가",  // 483
  "펄기아",  // 484
  "히드런",  // 485
  "레지기가스",  // 486
  "기라티나",  // 487
  "크레세리아",  // 488
  "피오네",  // 489
  "마나피",  // 490
  "다크라이",  // 491
  "쉐이미",  // 492
  "아르세우스",  // 493
  "비크티니",  // 494
  "주리비얀",  // 495
  "샤비",  // 496
  "샤로다",  // 497
  "뚜꾸리",  // 498
  "챠오꿀",  // 499
  "염무왕",  // 500
  "수댕이",  // 501
  "쌍검자비",  // 502
  "대검귀",  // 503
  "보르쥐",  // 504
  "보르그",  // 505
  "요테리",  // 506
  "하데리어",  // 507
  "바랜드",  // 508
  "쌔비냥",  // 509
  "레파르다스",  // 510
  "야나프",  // 511
  "야나키",  // 512
  "바오프",  // 513
  "바오키",  // 514
  "앗차프",  // 515
  "앗차키",  // 516
  "몽나",  // 517
  "몽얌나",  // 518
  "콩둘기",  // 519
  "유토브",  // 520
  "켄호로우",  // 521
  "줄뮤마",  // 522
  "제브라이카",  // 523
  "단굴",  // 524
  "암트르",  // 525
  "기가이어스",  // 526
  "또르박쥐",  // 527
  "맘박쥐",  // 528
  "두더류",  // 529
  "몰드류",  // 530
  "다부니",  // 531
  "으랏차",  // 532
  "토쇠골",  // 533
  "노보청",  // 534
  "동챙이",  // 535
  "두까비",  // 536
  "두빅굴",  // 537
  "던지미",  // 538
  "타격귀",  // 539
  "두르보",  // 540
  "두르쿤",  // 541
  "모아머",  // 542
  "마디네",  // 543
  "휠구",  // 544
  "펜드라",  // 545
  "소미안",  // 546
  "엘풍",  // 547
  "치릴리",  // 548
  "드레디어",  // 549
  "배쓰나이",  // 550
  "깜눈크",  // 551
  "악비르",  // 552
  "악비아르",  // 553
  "달막화",  // 554
  "불비달마",  // 555
  "마라카치",  // 556
  "돌살이",  // 557
  "암팰리스",  // 558
  "곤율랭",  // 559
  "곤율거니",  // 560
  "심보러",  // 561
  "데스마스",  // 562
  "데스니칸",  // 563
  "프로토가",  // 564
  "늑골라",  // 565
  "아켄",  // 566
  "아케오스",  // 567
  "깨봉이",  // 568
  "더스트나",  // 569
  "조로아",  // 570
  "조로아크",  // 571
  "치라미",  // 572
  "치라치노",  // 573
  "고디탱",  // 574
  "고디보미",  // 575
  "고디모아젤",  // 576
  "유니란",  // 577
  "듀란",  // 578
  "란쿨루스",  // 579
  "꼬지보리",  // 580
  "스완나",  // 581
  "바닐프티",  // 582
  "바닐리치",  // 583
  "배바닐라",  // 584
  "사철록",  // 585
  "바라철록",  // 586
  "에몽가",  // 587
  "딱정곤",  // 588
  "슈바르고",  // 589
  "깜놀버슬",  // 590
  "뽀록나",  // 591
  "탱그릴",  // 592
  "탱탱겔",  // 593
  "맘복치",  // 594
  "파쪼옥",  // 595
  "전툴라",  // 596
  "철시드",  // 597
  "너트령",  // 598
  "기어르",  // 599
  "기기어르",  // 600
  "기기기어르",  // 601
  "저리어",  // 602
  "저리릴",  // 603
  "저리더프",  // 604
  "리그레",  // 605
  "벰크",  // 606
  "불켜미",  // 607
  "램프라",  // 608
  "샹델라",  // 609
  "터검니",  // 610
  "액슨도",  // 611
  "액스라이즈",  // 612
  "코고미",  // 613
  "툰베어",  // 614
  "프리지오",  // 615
  "쪼마리",  // 616
  "어지리더",  // 617
  "메더",  // 618
  "비조푸",  // 619
  "비조도",  // 620
  "크리만",  // 621
  "골비람",  // 622
  "골루그",  // 623
  "자망칼",  // 624
  "절각참",  // 625
  "버프론",  // 626
  "수리둥보",  // 627
  "워글",  // 628
  "벌차이",  // 629
  "버랜지나",  // 630
  "앤티골",  // 631
  "아이앤트",  // 632
  "모노두",  // 633
  "디헤드",  // 634
  "삼삼드래",  // 635
  "활화르바",  // 636
  "불카모스",  // 637
  "코바르온",  // 638
  "테라키온",  // 639
  "비리디온",  // 640
  "토네로스",  // 641
  "볼트로스",  // 642
  "레시라무",  // 643
  "제크로무",  // 644
  "랜드로스",  // 645
  "큐레무",  // 646
  "케르디오",  // 647
  "메로엣타",  // 648
  "게노세크트",  // 649
  "도치마론",  // 650
  "도치보구",  // 651
  "브리가론",  // 652
  "푸호꼬",  // 653
  "테르나",  // 654
  "마폭시",  // 655
  "개구마르",  // 656
  "개굴반장",  // 657
  "개굴닌자",  // 658
  "파르빗",  // 659
  "파르토",  // 660
  "화살꼬빈",  // 661
  "불화살빈",  // 662
  "파이어로",  // 663
  "분이벌레",  // 664
  "분떠도리",  // 665
  "비비용",  // 666
  "레오꼬",  // 667
  "화염레오",  // 668
  "플라베베",  // 669
  "플라엣테",  // 670
  "플라제스",  // 671
  "메이클",  // 672
  "고고트",  // 673
  "판짱",  // 674
  "부란다",  // 675
  "트리미앙",  // 676
  "냐스퍼",  // 677
  "냐오닉스",  // 678
  "단칼빙",  // 679
  "쌍검킬",  // 680
  "킬가르도",  // 681
  "슈쁘",  // 682
  "프레프티르",  // 683
  "나룸퍼프",  // 684
  "나루림",  // 685
  "오케이징",  // 686
  "칼라마네로",  // 687
  "거북손손",  // 688
  "거북손데스",  // 689
  "수레기",  // 690
  "드래캄",  // 691
  "완철포",  // 692
  "블로스터",  // 693
  "목도리키텔",  // 694
  "일레도리자드",  // 695
  "티고라스",  // 696
  "견고라스",  // 697
  "아마루스",  // 698
  "아마루르가",  // 699
  "님피아",  // 700
  "루차불",  // 701
  "데덴네",  // 702
  "멜리시",  // 703
  "미끄메라",  // 704
  "미끄네일",  // 705
  "미끄래곤",  // 706
  "클레피",  // 707
  "나목령",  // 708
  "대로트",  // 709
  "호바귀",  // 710
  "펌킨인",  // 711
  "꽁어름",  // 712
  "크레베이스",  // 713
  "음뱃",  // 714
  "음번",  // 715
  "제르네아스",  // 716
  "이벨타르",  // 717
  "지가르데",  // 718
  "디안시",  // 719
  "후파",  // 720
  "볼케니온",  // 721
  "나몰빼미",  // 722
  "빼미스로우",  // 723
  "모크나이퍼",  // 724
  "냐오불",  // 725
  "냐오히트",  // 726
  "어흥염",  // 727
  "누리공",  // 728
  "키요공",  // 729
  "누리레느",  // 730
  "콕코구리",  // 731
  "크라파",  // 732
  "왕큰부리",  // 733
  "영구스",  // 734
  "형사구스",  // 735
  "턱지충이",  // 736
  "전지충이",  // 737
  "투구뿌논",  // 738
  "오기지게",  // 739
  "모단단게",  // 740
  "춤추새",  // 741
  "에블리",  // 742
  "에리본",  // 743
  "암멍이",  // 744
  "루가루암",  // 745
  "약어리",  // 746
  "시마사리",  // 747
  "더시마사리",  // 748
  "머드나기",  // 749
  "만마드",  // 750
  "물거미",  // 751
  "깨비물거미",  // 752
  "짜랑랑",  // 753
  "라란티스",  // 754
  "자마슈",  // 755
  "마셰이드",  // 756
  "야도뇽",  // 757
  "염뉴트",  // 758
  "포곰곰",  // 759
  "이븐곰",  // 760
  "달콤아",  // 761
  "달무리나",  // 762
  "달코퀸",  // 763
  "큐아링",  // 764
  "하랑우탄",  // 765
  "내던숭이",  // 766
  "꼬시레",  // 767
  "갑주무사",  // 768
  "모래꿍",  // 769
  "모래성이당",  // 770
  "해무기",  // 771
  "타입:널",  // 772
  "실버디",  // 773
  "메테노",  // 774
  "자말라",  // 775
  "폭거북스",  // 776
  "토게데마루",  // 777
  "따라큐",  // 778
  "치갈기",  // 779
  "할비롱",  // 780
  "타타륜",  // 781
  "짜랑꼬",  // 782
  "짜랑고우",  // 783
  "짜랑고우거",  // 784
  "카푸꼬꼬꼭",  // 785
  "카푸나비나",  // 786
  "카푸브루루",  // 787
  "카푸느지느",  // 788
  "코스모그",  // 789
  "코스모움",  // 790
  "솔가레오",  // 791
  "루나아라",  // 792
  "텅비드",  // 793
  "매시붕",  // 794
  "페로코체",  // 795
  "전수목",  // 796
  "철화구야",  // 797
  "종이신도",  // 798
  "악식킹",  // 799
  "네크로즈마",  // 800
  "마기아나",  // 801
  "마샤도",  // 802
  "베베놈",  // 803
  "아고용",  // 804
  "차곡차곡",  // 805
  "두파팡",  // 806
  "제라오라",  // 807
  "멜탄",  // 808
  "멜메탈",  // 809
  "알로라 꼬렛",  // 810
  "알로라 레트라",  // 811
  "알로라 라이츄",  // 812
  "알로라 모래두지",  // 813
  "알로라 고지",  // 814
  "알로라 식스테일",  // 815
  "알로라 나인테일",  // 816
  "알로라 디그다",  // 817
  "알로라 닥트리오",  // 818
  "알로라 나옹",  // 819
  "알로라 페르시온",  // 820
  "알로라 꼬마돌",  // 821
  "알로라 데구리",  // 822
  "알로라 딱구리",  // 823
  "알로라 질퍽이",  // 824
  "알로라 질뻐기",  // 825
  "알로라 나시",  // 826
  "알로라 텅구리",  // 827
  "흥나숭",  // 828
  "채키몽",  // 829
  "고릴타",  // 830
  "염버니",  // 831
  "래비풋",  // 832
  "에이스번",  // 833
  "울머기",  // 834
  "누겔레온",  // 835
  "인텔리레온",  // 836
  "탐리스",  // 837
  "요씽리스",  // 838
  "파라꼬",  // 839
  "파크로우",  // 840
  "아머까오",  // 841
  "두루지벌레",  // 842
  "레돔벌레",  // 843
  "이올브",  // 844
  "훔처우",  // 845
  "폭슬라이",  // 846
  "꼬모카",  // 847
  "백솜모카",  // 848
  "우르",  // 849
  "배우르",  // 850
  "깨물부기",  // 851
  "갈가부기",  // 852
  "멍파치",  // 853
  "펄스멍",  // 854
  "탄동",  // 855
  "탄차곤",  // 856
  "석탄산",  // 857
  "과사삭벌레",  // 858
  "애프룡",  // 859
  "단지래플",  // 860
  "모래뱀",  // 861
  "사다이사",  // 862
  "윽우지",  // 863
  "찌로꼬치",  // 864
  "꼬치조",  // 865
  "일레즌",  // 866
  "스트린더",  // 867
  "태우지네",  // 868
  "다태우지네",  // 869
  "때때무노",  // 870
  "케오퍼스",  // 871
  "데인차",  // 872
  "포트데스",  // 873
  "몸지브림",  // 874
  "손지브림",  // 875
  "브리무음",  // 876
  "메롱꿍",  // 877
  "쏘겨모",  // 878
  "오롱털",  // 879
  "가로막구리",  // 880
  "나이킹",  // 881
  "산호르곤",  // 882
  "창파나이트",  // 883
  "마임꽁꽁",  // 884
  "데스판",  // 885
  "마빌크",  // 886
  "마휘핑",  // 887
  "대여르",  // 888
  "찌르성게",  // 889
  "누니머기",  // 890
  "모스노우",  // 891
  "돌헨진",  // 892
  "빙큐보",  // 893
  "에써르",  // 894
  "모르페코",  // 895
  "끼리동",  // 896
  "대왕끼리동",  // 897
  "파치래곤",  // 898
  "파치르돈",  // 899
  "어래곤",  // 900
  "어치르돈",  // 901
  "두랄루돈",  // 902
  "드라꼰",  // 903
  "드래런치",  // 904
  "드래펄트",  // 905
  "자시안",  // 906
  "자마젠타",  // 907
  "무한다이노",  // 908
  "치고마",  // 909
  "우라오스",  // 910
  "자루도",  // 911
  "레지에레키",  // 912
  "레지드래고",  // 913
  "블리자포스",  // 914
  "레이스포스",  // 915
  "버드렉스",  // 916
  "신비록",  // 917
  "사마자르",  // 918
  "다투곰",  // 919
  "대쓰여너",  // 920
  "포푸니크",  // 921
  "장침바루",  // 922
  "러브로스",  // 923
  "나오하",  // 924
  "나로테",  // 925
  "마스카나",  // 926
  "뜨아거",  // 927
  "악뜨거",  // 928
  "라우드본",  // 929
  "꾸왁스",  // 930
  "아꾸왁",  // 931
  "웨이니발",  // 932
  "맛보돈",  // 933
  "퍼퓨돈",  // 934
  "타랜툴라",  // 935
  "트래피더",  // 936
  "콩알뚜기",  // 937
  "엑스레그",  // 938
  "빠모",  // 939
  "빠모트",  // 940
  "빠르모트",  // 941
  "두리쥐",  // 942
  "파밀리쥐",  // 943
  "쫀도기",  // 944
  "바우첼",  // 945
  "미니브",  // 946
  "올리뇨",  // 947
  "올리르바",  // 948
  "시비꼬",  // 949
  "베베솔트",  // 950
  "스태솔트",  // 951
  "콜로솔트",  // 952
  "카르본",  // 953
  "카디나르마",  // 954
  "파라블레이즈",  // 955
  "빈나두",  // 956
  "찌리배리",  // 957
  "찌리비",  // 958
  "찌리비크",  // 959
  "오라티프",  // 960
  "마피티프",  // 961
  "땃쭈르",  // 962
  "태깅구르",  // 963
  "그푸리",  // 964
  "공푸리",  // 965
  "들눈해",  // 966
  "육파리",  // 967
  "절벼게",  // 968
  "캡싸이",  // 969
  "스코빌런",  // 970
  "구르데",  // 971
  "베라카스",  // 972
  "하느라기",  // 973
  "클레스퍼트라",  // 974
  "어리짱",  // 975
  "벼리짱",  // 976
  "두드리짱",  // 977
  "바다그다",  // 978
  "바닥트리오",  // 979
  "떨구새",  // 980
  "맨돌핀",  // 981
  "돌핀맨",  // 982
  "부르롱",  // 983
  "부르르룸",  // 984
  "모토마",  // 985
  "꿈트렁",  // 986
  "초롱순",  // 987
  "킬라플로르",  // 988
  "망망이",  // 989
  "묘두기",  // 990
  "꼬이밍고",  // 991
  "터벅고래",  // 992
  "우락고래",  // 993
  "가비루사",  // 994
  "어써러셔",  // 995
  "싸리용",  // 996
  "저승갓숭",  // 997
  "토오",  // 998
  "키키링",  // 999
  "노고고치",  // 1000
  "대도각참",  // 1001
  "위대한엄니",  // 1002
  "우렁찬꼬리",  // 1003
  "사나운버섯",  // 1004
  "날개치는머리",  // 1005
  "땅을기는날개",  // 1006
  "모래털가죽",  // 1007
  "무쇠바퀴",  // 1008
  "무쇠보따리",  // 1009
  "무쇠손",  // 1010
  "무쇠머리",  // 1011
  "무쇠독나방",  // 1012
  "무쇠가시",  // 1013
  "드니차",  // 1014
  "드니꽁",  // 1015
  "드닐레이브",  // 1016
  "모으령",  // 1017
  "타부자고",  // 1018
  "총지엔",  // 1019
  "파오젠",  // 1020
  "딩루",  // 1021
  "위유이",  // 1022
  "고동치는달",  // 1023
  "무쇠무인",  // 1024
  "코라이돈",  // 1025
  "미라이돈",  // 1026
  "굽이치는물결",  // 1027
  "무쇠잎새",  // 1028
  "과미르",  // 1029
  "차데스",  // 1030
  "그우린차",  // 1031
  "조타구",  // 1032
  "이야후",  // 1033
  "기로치",  // 1034
  "오거폰",  // 1035
  "브리두라스",  // 1036
  "과미드라",  // 1037
  "꿰뚫는화염",  // 1038
  "날뛰는우레",  // 1039
  "무쇠암석",  // 1040
  "무쇠감투",  // 1041
  "테라파고스",  // 1042
  "복숭악동",  // 1043
  "-",  // 1044
  "-",  // 1045
  "-",  // 1046
  "-",  // 1047
  "-",  // 1048
  "-",  // 1049
  "-",  // 1050
  "-",  // 1051
  "-",  // 1052
  "-",  // 1053
  "-",  // 1054
  "-",  // 1055
  "-",  // 1056
  "-",  // 1057
  "-",  // 1058
  "-",  // 1059
  "-",  // 1060
  "-",  // 1061
  "-",  // 1062
  "-",  // 1063
  "-",  // 1064
  "-",  // 1065
  "-",  // 1066
  "-",  // 1067
  "-",  // 1068
  "-",  // 1069
  "-",  // 1070
  "-",  // 1071
  "-",  // 1072
  "-",  // 1073
  "-",  // 1074
  "-",  // 1075
  "-",  // 1076
  "-",  // 1077
  "-",  // 1078
  "-",  // 1079
  "-",  // 1080
  "-",  // 1081
  "-",  // 1082
  "-",  // 1083
  "-",  // 1084
  "-",  // 1085
  "-",  // 1086
  "-",  // 1087
  "-",  // 1088
  "-",  // 1089
  "-",  // 1090
  "-",  // 1091
  "-",  // 1092
  "-",  // 1093
  "-",  // 1094
  "-",  // 1095
  "-",  // 1096
  "-",  // 1097
  "-",  // 1098
  "-",  // 1099
  "-",  // 1100
  "-",  // 1101
  "-",  // 1102
  "-",  // 1103
  "-",  // 1104
  "-",  // 1105
  "-",  // 1106
  "-",  // 1107
  "-",  // 1108
  "-",  // 1109
  "-",  // 1110
  "-",  // 1111
  "-",  // 1112
  "-",  // 1113
  "-",  // 1114
  "-",  // 1115
  "-",  // 1116
  "-",  // 1117
  "-",  // 1118
  "-",  // 1119
  "-",  // 1120
  "-",  // 1121
  "-",  // 1122
  "-",  // 1123
  "-",  // 1124
  "-",  // 1125
  "-",  // 1126
  "-",  // 1127
  "-",  // 1128
  "-",  // 1129
  "-",  // 1130
  "-",  // 1131
  "-",  // 1132
  "-",  // 1133
  "-",  // 1134
  "-",  // 1135
  "-",  // 1136
  "-",  // 1137
  "-",  // 1138
  "-",  // 1139
  "-",  // 1140
  "-",  // 1141
  "-",  // 1142
  "-",  // 1143
  "-",  // 1144
  "-",  // 1145
  "-",  // 1146
  "-",  // 1147
  "-",  // 1148
  "-",  // 1149
  "-",  // 1150
  "-",  // 1151
  "-",  // 1152
  "-",  // 1153
  "-",  // 1154
  "-",  // 1155
  "-",  // 1156
  "-",  // 1157
  "-",  // 1158
  "-",  // 1159
  "-",  // 1160
  "-",  // 1161
  "-",  // 1162
  "-",  // 1163
  "-",  // 1164
  "-",  // 1165
  "-",  // 1166
  "-",  // 1167
  "-",  // 1168
  "-",  // 1169
  "-",  // 1170
  "-",  // 1171
  "-",  // 1172
  "-",  // 1173
  "-",  // 1174
  "-",  // 1175
  "-",  // 1176
  "-",  // 1177
  "-",  // 1178
  "-",  // 1179
  "-",  // 1180
  "-",  // 1181
  "-",  // 1182
  "-",  // 1183
  "-",  // 1184
  "-",  // 1185
  "-",  // 1186
  "-",  // 1187
  "-",  // 1188
  "-",  // 1189
  "-",  // 1190
  "-",  // 1191
  "-",  // 1192
  "-",  // 1193
  "-",  // 1194
  "-",  // 1195
  "-",  // 1196
  "-",  // 1197
  "-",  // 1198
  "-",  // 1199
  "m.리자몽X",  // 1200
  "피카츄 Libre",  // 1201
  "피카츄 Cosplay",  // 1202
  "가라르 나옹",  // 1203
  "히스이 가디",  // 1204
  "히스이 윈디",  // 1205
  "m.후딘",  // 1206
  "가라르 포니타",  // 1207
  "가라르 날쌩마",  // 1208
  "가라르 야돈",  // 1209
  "가라르 야도란",  // 1210
  "m.야도란",  // 1211
  "가라르 파오리",  // 1212
  "m.팬텀",  // 1213
  "히스이 찌리리공",  // 1214
  "히스이 붐볼",  // 1215
  "가라르 또도가스",  // 1216
  "m.캥카",  // 1217
  "가라르 마임맨",  // 1218
  "팔데아 켄타로스",  // 1219
  "팔데아 켄타로스",  // 1220
  "팔데아 켄타로스",  // 1221
  "m.프테라",  // 1222
  "가라르 프리져",  // 1223
  "가라르 썬더",  // 1224
  "가라르 파이어",  // 1225
  "m.뮤츠Y",  // 1226
  "뮤츠 Shadow",  // 1227
  "히스이 블레이범",  // 1228
  "피츄 Spiky",  // 1229
  "팔데아 우파",  // 1230
  "가라르 야도킹",  // 1231
  "안농 B",  // 1232
  "안농 C",  // 1233
  "안농 D",  // 1234
  "안농 E",  // 1235
  "안농 F",  // 1236
  "안농 G",  // 1237
  "안농 H",  // 1238
  "안농 I",  // 1239
  "안농 J",  // 1240
  "안농 K",  // 1241
  "안농 L",  // 1242
  "안농 M",  // 1243
  "안농 N",  // 1244
  "안농 O",  // 1245
  "안농 P",  // 1246
  "안농 Q",  // 1247
  "안농 R",  // 1248
  "안농 S",  // 1249
  "안농 T",  // 1250
  "안농 U",  // 1251
  "안농 V",  // 1252
  "안농 W",  // 1253
  "안농 X",  // 1254
  "안농 Y",  // 1255
  "안농 Z",  // 1256
  "안농 Exclamation",  // 1257
  "안농 Question",  // 1258
  "m.강철톤",  // 1259
  "히스이 침바루",  // 1260
  "히스이 포푸니",  // 1261
  "가라르 코산호",  // 1262
  "m.무장조",  // 1263
  "m.헬가",  // 1264
  "m.마기라스",  // 1265
  "루기아 Shadow",  // 1266
  "가라르 지그제구리",  // 1267
  "가라르 직구리",  // 1268
  "m.가디안",  // 1269
  "m.깜까미",  // 1270
  "m.입치트",  // 1271
  "m.요가램",  // 1272
  "m.썬더볼트",  // 1273
  "m.폭타",  // 1274
  "m.파비코리",  // 1275
  "캐스퐁 Sunny",  // 1276
  "캐스퐁 Rainy",  // 1277
  "캐스퐁 Snowy",  // 1278
  "켈리몬 Purple",  // 1279
  "m.다크펫",  // 1280
  "m.얼음귀신",  // 1281
  "m.라티아스",  // 1282
  "m.라티오스",  // 1283
  "m.레쿠쟈",  // 1284
  "테오키스 공격",  // 1285
  "테오키스 방어",  // 1286
  "테오키스 스피드",  // 1287
  "도롱충이 Sand",  // 1288
  "도롱충이 Trash",  // 1289
  "도롱마담 Sand",  // 1290
  "도롱마담 Trash",  // 1291
  "체리꼬 Sunshine",  // 1292
  "깝질무 East",  // 1293
  "트리토돈 East",  // 1294
  "m.이어롭",  // 1295
  "m.루카리오",  // 1296
  "m.엘레이드",  // 1297
  "로토무 히트",  // 1298
  "로토무 워시",  // 1299
  "로토무 프로스트",  // 1300
  "로토무 팬",  // 1301
  "로토무 커트",  // 1302
  "로토무 Drone",  // 1303
  "디아루가 오리진",  // 1304
  "펄기아 오리진",  // 1305
  "기라티나 오리진",  // 1306
  "m.다크라이",  // 1307
  "쉐이미 스카이",  // 1308
  "아르세우스 Bug",  // 1309
  "아르세우스 Dark",  // 1310
  "아르세우스 Dragon",  // 1311
  "아르세우스 Electric",  // 1312
  "아르세우스 Fighting",  // 1313
  "아르세우스 Fire",  // 1314
  "아르세우스 Flying",  // 1315
  "아르세우스 Ghost",  // 1316
  "아르세우스 Grass",  // 1317
  "아르세우스 Ground",  // 1318
  "아르세우스 Ice",  // 1319
  "아르세우스 Poison",  // 1320
  "아르세우스 Psychic",  // 1321
  "아르세우스 Rock",  // 1322
  "아르세우스 Steel",  // 1323
  "아르세우스 Water",  // 1324
  "아르세우스 Fairy",  // 1325
  "아르세우스 Question_Mark",  // 1326
  "히스이 대검귀",  // 1327
  "m.몰드류",  // 1328
  "히스이 드레디어",  // 1329
  "배쓰나이 Blue",  // 1330
  "배쓰나이 White",  // 1331
  "가라르 달막화",  // 1332
  "불비달마 Zen",  // 1333
  "가라르 불비달마",  // 1334
  "가라르 데스마스",  // 1335
  "히스이 조로아",  // 1336
  "히스이 조로아크",  // 1337
  "사철록 Summer",  // 1338
  "사철록 Autumn",  // 1339
  "사철록 Winter",  // 1340
  "바라철록 Summer",  // 1341
  "바라철록 Autumn",  // 1342
  "바라철록 Winter",  // 1343
  "m.저리더프",  // 1344
  "히스이 워글",  // 1345
  "레시라무 Skytemple",  // 1346
  "랜드로스 영물",  // 1347
  "큐레무 Black",  // 1348
  "큐레무 White",  // 1349
  "큐레무 White_Skytemple",  // 1350
  "큐레무 Black_Skytemple",  // 1351
  "메로엣타 Pirouette",  // 1352
  "게노세크트 Douse",  // 1353
  "게노세크트 Shock",  // 1354
  "게노세크트 Burn",  // 1355
  "게노세크트 Chill",  // 1356
  "비비용 Icy_Snow",  // 1357
  "비비용 Polar",  // 1358
  "비비용 Tundra",  // 1359
  "비비용 Continental",  // 1360
  "비비용 Garden",  // 1361
  "비비용 Elegant",  // 1362
  "비비용 Modern",  // 1363
  "비비용 Marine",  // 1364
  "비비용 Archipelago",  // 1365
  "비비용 High_Plains",  // 1366
  "비비용 Sandstorm",  // 1367
  "비비용 River",  // 1368
  "비비용 Monsoon",  // 1369
  "비비용 Savannah",  // 1370
  "비비용 Sun",  // 1371
  "비비용 Ocean",  // 1372
  "비비용 Jungle",  // 1373
  "비비용 Fancy",  // 1374
  "비비용 Pokeball",  // 1375
  "플라베베 Yellow",  // 1376
  "플라베베 Orange",  // 1377
  "플라베베 Blue",  // 1378
  "플라베베 White",  // 1379
  "플라엣테 Yellow",  // 1380
  "플라엣테 Orange",  // 1381
  "플라엣테 Blue",  // 1382
  "플라엣테 White",  // 1383
  "플라엣테 Eternal",  // 1384
  "m.플라엣테",  // 1385
  "플라제스 Yellow",  // 1386
  "플라제스 Orange",  // 1387
  "플라제스 Blue",  // 1388
  "플라제스 White",  // 1389
  "트리미앙 Kabuki",  // 1390
  "킬가르도 Blade",  // 1391
  "m.드래캄",  // 1392
  "히스이 미끄네일",  // 1393
  "히스이 미끄래곤",  // 1394
  "호바귀 Small",  // 1395
  "호바귀 Large",  // 1396
  "호바귀 Super",  // 1397
  "펌킨인 Super",  // 1398
  "히스이 크레베이스",  // 1399
  "제르네아스 Neutral",  // 1400
  "지가르데 10",  // 1401
  "지가르데 Complete",  // 1402
  "m.지가르데",  // 1403
  "지가르데 Complete_Skytemple",  // 1404
  "m.디안시",  // 1405
  "후파 Unbound",  // 1406
  "히스이 모크나이퍼",  // 1407
  "춤추새 Pom_Pom",  // 1408
  "춤추새 Pa_U",  // 1409
  "루가루암 한밤중",  // 1410
  "루가루암 황혼",  // 1411
  "약어리 군집",  // 1412
  "실버디 Fighting",  // 1413
  "실버디 Flying",  // 1414
  "실버디 Poison",  // 1415
  "실버디 Ground",  // 1416
  "실버디 Rock",  // 1417
  "실버디 Bug",  // 1418
  "실버디 Ghost",  // 1419
  "실버디 Steel",  // 1420
  "실버디 Fire",  // 1421
  "실버디 Water",  // 1422
  "실버디 Grass",  // 1423
  "실버디 Electric",  // 1424
  "실버디 Psychic",  // 1425
  "실버디 Ice",  // 1426
  "실버디 Dragon",  // 1427
  "실버디 Dark",  // 1428
  "실버디 Fairy",  // 1429
  "메테노 Red",  // 1430
  "메테노 Orange",  // 1431
  "메테노 Yellow",  // 1432
  "메테노 Green",  // 1433
  "메테노 Blue",  // 1434
  "메테노 Indigo",  // 1435
  "메테노 Violet",  // 1436
  "따라큐 Busted",  // 1437
  "m.할비롱",  // 1438
  "네크로즈마 Ultra",  // 1439
  "마기아나 Original",  // 1440
  "m.제라오라",  // 1441
  "과사삭벌레 No_Apple",  // 1442
  "스트린더 Lowkey",  // 1443
  "마휘핑 Berry_Sweet",  // 1444
  "마휘핑 Love_Sweet",  // 1445
  "마휘핑 Star_Sweet",  // 1446
  "마휘핑 Clover_Sweet",  // 1447
  "마휘핑 Flower_Sweet",  // 1448
  "마휘핑 Ribbon_Sweet",  // 1449
  "마휘핑 Ruby_Cream_Strawberry_Sweet",  // 1450
  "마휘핑 Ruby_Cream_Berry_Sweet",  // 1451
  "마휘핑 Ruby_Cream_Love_Sweet",  // 1452
  "마휘핑 Ruby_Cream_Star_Sweet",  // 1453
  "마휘핑 Ruby_Cream_Clover_Sweet",  // 1454
  "마휘핑 Ruby_Cream_Flower_Sweet",  // 1455
  "마휘핑 Ruby_Cream_Ribbon_Sweet",  // 1456
  "마휘핑 Matcha_Cream_Strawberry_Sweet",  // 1457
  "마휘핑 Matcha_Cream_Berry_Sweet",  // 1458
  "마휘핑 Matcha_Cream_Love_Sweet",  // 1459
  "마휘핑 Matcha_Cream_Star_Sweet",  // 1460
  "마휘핑 Matcha_Cream_Clover_Sweet",  // 1461
  "마휘핑 Matcha_Cream_Flower_Sweet",  // 1462
  "마휘핑 Matcha_Cream_Ribbon_Sweet",  // 1463
  "마휘핑 Mint_Cream_Strawberry_Sweet",  // 1464
  "마휘핑 Mint_Cream_Berry_Sweet",  // 1465
  "마휘핑 Mint_Cream_Love_Sweet",  // 1466
  "마휘핑 Mint_Cream_Star_Sweet",  // 1467
  "마휘핑 Mint_Cream_Clover_Sweet",  // 1468
  "마휘핑 Mint_Cream_Flower_Sweet",  // 1469
  "마휘핑 Mint_Cream_Ribbon_Sweet",  // 1470
  "마휘핑 Lemon_Cream_Strawberry_Sweet",  // 1471
  "마휘핑 Lemon_Cream_Berry_Sweet",  // 1472
  "마휘핑 Lemon_Cream_Love_Sweet",  // 1473
  "마휘핑 Lemon_Cream_Star_Sweet",  // 1474
  "마휘핑 Lemon_Cream_Clover_Sweet",  // 1475
  "마휘핑 Lemon_Cream_Flower_Sweet",  // 1476
  "마휘핑 Lemon_Cream_Ribbon_Sweet",  // 1477
  "마휘핑 Salted_Cream_Strawberry_Sweet",  // 1478
  "마휘핑 Salted_Cream_Berry_Sweet",  // 1479
  "마휘핑 Salted_Cream_Love_Sweet",  // 1480
  "마휘핑 Salted_Cream_Star_Sweet",  // 1481
  "마휘핑 Salted_Cream_Clover_Sweet",  // 1482
  "마휘핑 Salted_Cream_Flower_Sweet",  // 1483
  "마휘핑 Salted_Cream_Ribbon_Sweet",  // 1484
  "마휘핑 Ruby_Swirl_Strawberry_Sweet",  // 1485
  "마휘핑 Ruby_Swirl_Berry_Sweet",  // 1486
  "마휘핑 Ruby_Swirl_Love_Sweet",  // 1487
  "마휘핑 Ruby_Swirl_Star_Sweet",  // 1488
  "마휘핑 Ruby_Swirl_Clover_Sweet",  // 1489
  "마휘핑 Ruby_Swirl_Flower_Sweet",  // 1490
  "마휘핑 Ruby_Swirl_Ribbon_Sweet",  // 1491
  "마휘핑 Caramel_Swirl_Strawberry_Sweet",  // 1492
  "마휘핑 Caramel_Swirl_Berry_Sweet",  // 1493
  "마휘핑 Caramel_Swirl_Love_Sweet",  // 1494
  "마휘핑 Caramel_Swirl_Star_Sweet",  // 1495
  "마휘핑 Caramel_Swirl_Clover_Sweet",  // 1496
  "마휘핑 Caramel_Swirl_Flower_Sweet",  // 1497
  "마휘핑 Caramel_Swirl_Ribbon_Sweet",  // 1498
  "마휘핑 Rainbow_Swirl_Strawberry_Sweet",  // 1499
  "마휘핑 Rainbow_Swirl_Berry_Sweet",  // 1500
  "마휘핑 Rainbow_Swirl_Love_Sweet",  // 1501
  "마휘핑 Rainbow_Swirl_Star_Sweet",  // 1502
  "마휘핑 Rainbow_Swirl_Clover_Sweet",  // 1503
  "마휘핑 Rainbow_Swirl_Flower_Sweet",  // 1504
  "마휘핑 Rainbow_Swirl_Ribbon_Sweet",  // 1505
  "대여르 Brass",  // 1506
  "대여르 Trooper",  // 1507
  "빙큐보 Noice",  // 1508
  "모르페코 배고픔",  // 1509
  "우라오스 Rapid_Strike",  // 1510
  "다투곰 붉은달",  // 1511
  "러브로스 영물",  // 1512
  "두리쥐 Shirt",  // 1513
  "두리쥐 Pants",  // 1514
  "파밀리쥐 Three",  // 1515
  "파밀리쥐 Baby",  // 1516
  "돌핀맨 마이티",  // 1517
  "싸리용 Stretchy",  // 1518
  "싸리용 Droopy",  // 1519
  "m.싸리용",  // 1520
  "모으령 떠돌이",  // 1521
  "딩루 Temp",  // 1522
  "미라이돈 Low_Power",  // 1523
  "오거폰 우물",  // 1524
  "오거폰 화덕",  // 1525
  "오거폰 주춧돌",  // 1526
  "오거폰 Teal_Mask",  // 1527
  "오거폰 Wellspring_Mask",  // 1528
  "오거폰 Hearthflame_Mask",  // 1529
  "오거폰 Cornerstone_Mask",  // 1530
};
static_assert(sizeof(KO_SPECIES_NAMES) / sizeof(KO_SPECIES_NAMES[0]) == DEX_COUNT + 1, "KO species table size");
